Repository: Adedunmol/Jumia
Catalog: website/translations/yo/LC_MESSAGES/messages.po
Languages: yo

source: Please log in to access this page.
yo: e jo e log in lati ri page yii

source: Your account has been created!
yo: account yin ti waa!

source: You are logged in successfully
yo: e ti wa logged in

source: The details you entered is not correct
yo: awon ti e fi sile o correct

source: Your product has been posted
yo: product yin ti wa

source: Your account has been updated
yo: account yin ti wa updated

source: Your product has been deleted.
yo: a ti delete product yin

source: A link has been sent to your email
yo: a ti send link kan si mail yin

source: This token is invalid or expired
yo: token yii koda tabi o ti expire

source: Your password has been updated. You can now log in.
yo: ati update password yin. E le log in nisin

source: Username
yo: oruko ti e lo

source: Email
yo: email yin

source: Password
yo: password yin

source: Confirm_password
yo: e type password tie lo fun eyi ti e type tele

source: Register
yo: e register

source: Please choose another username.
yo: e jo e mu oruko mi

source: Please choose another email.
yo: e jo e mu email mi

source: Remember me
yo: ranti mi

source: Title
yo: akole

source: Description
yo: alaye

source: Price
yo: iye tio je

source: Image
yo: aworan

source: Submit
yo: e submit

source: Update Account
yo: e chnage nkan lori account yin

source: Update post
yo: e change nkan lori post yii

source: Reset password
yo: e change password yin

source: There is no user with this email. Kindly register.
yo: ko si user kan kan pelu email yii. e jo e register.

source: Confirm Password
yo: e type password tie lo fun eyi ti e type tele

source: Search
yo: e wa product kan

source: Posted by
yo: eni ti o post

source: Add to cart
yo: e fi si cart yin

source: This is an ecommerce website
yo: website fun rira tita

source: Personal Details
yo: details nipa yin

source: Home
yo: ile

source: About
yo: nipa

source: New Post
yo: post tuntun

source: Account
yo: account yin

source: CHat
yo: ba won eyan soro

source: Logout
yo: e log out

source: Check it out
yo: yewo

source: Need an account?
yo: e fe account?

source: Sign Up
yo: e sign up

source: Forgot Password
yo: gbagbe password

source: Date posted
yo: ojo ti wan post

source: Are you sure you want to delete this product?
yo: se e sure wipe e fe delete product yii

source: Join Today
yo: e darapo loni

source: Already Have An Account?
yo: e ni account tele?

source: Sign In
yo: e sign in

source: Previous results
yo: awon results leyin

source: Next results
yo: awon results miran

source: Oops. Page Not Found (404)
yo: ahh. kosi page yii(404)

source: That page does not exist. Please try a different location
yo: ko sii page yii. e try ibo miran

source: Something went wrong (500)
yo: nkan tii shele(500)

source: We are experiencing some trouble on our end. Please try again in the near future
yo: a ni wahala kokan ni odo wa. e jo e tun try nii ojo iwaju
